; domain
(define (domain default)
    (:requirements :strips :typing :negative-preconditions :numeric-fluents)
    (:types
        location tile agent box workstation warehouse
        bolt valve tool - supply  ; bolt, valve, and tool are subtypes of supply
        supply                    ; supply is defined as a higher-level type
    )
    (:functions
        (num_objects_at ?e - workstation ?s - supply)
    )
    (:predicates
        ; Positioning
        (adjacent ?l1 ?l2 - location)       ; location ?l1 is adjacent to ?l2
        (at ?e - (either agent supply box workstation warehouse) ?l - location)  ; entity ?e is at location ?l
        (free_from_agent ?l - location)  ; location ?l is free
        ; Box interaction
        (empty ?b - box)      ; box ?b is empty
        (contains ?b - box ?s - supply)  ; box ?b contains supply ?s
        (holding ?e - agent ?s - (either supply box))
        (supplied_with ?ws - workstation ?s - supply)
    )

    ;; moves an agent between two adjacent locations
    (:action move
        :parameters (?a - agent ?from ?to - location)
        :precondition (and 
            (adjacent ?from ?to) 
            (at ?a ?from) 
            (free_from_agent ?to)
        )
        :effect (and 
            (at ?a ?to) 
            (free_from_agent ?from) 
            (not (free_from_agent ?to)) 
            (not (at ?a ?from))
            ; If the agent is holding a box, the box is implicitly moved with the agent
            ; and there's no need to update the box or its contents' locations explicitly
        )
    )


    (:action pick_up_box
        :parameters (?a - agent ?b - box ?l - location)
        :precondition (and (at ?a ?l) (at ?b ?l) (forall (?b - box) (not (holding ?a ?b))))
        :effect (and (holding ?a ?b) (not (at ?b ?l)))
    )
    
    (:action fill_box
        :parameters (?a - agent ?b - box ?s - supply ?l - location)
        :precondition (and (empty ?b) (at ?a ?l) (at ?b ?l) (at ?s ?l) (not (holding ?a ?b)))
        :effect (and (not (empty ?b)) (contains ?b ?s) (not (at ?s ?l))) 
    )

    (:action leave_box_at_workstation
        :parameters (?a - agent ?b - box ?ws - workstation ?l - location)
        :precondition (and
            (at ?a ?l)        ; Agent is at the location
            (holding ?a ?b)   ; Agent is holding the box
            (at ?ws ?l)       ; Workstation is at the location
        )
        :effect (and
            (not (holding ?a ?b))   ; Agent is no longer holding the box
            (at ?b ?l)              ; Box is now at the workstation's location
            ; Keep the box's content as it is for now
        )
    )

    (:action process_box_contents_at_workstation
        :parameters (?b - box ?s - supply ?ws - workstation ?l - location)
        :precondition (and
            (at ?b ?l)         ; Box is at the workstation's location
            (at ?ws ?l)        ; Workstation is at the location
            (contains ?b ?s)   ; Box contains the supply
        )
        :effect (and
            (not (contains ?b ?s))  ; Box no longer contains the supply
            (supplied_with ?ws ?s)  ; Workstation is marked as supplied with the supply
            (empty ?b)              ; Box is now empty
            (increase (num_objects_at ?ws ?s) 1)  ; Increase the count of the supply type at the workstation
            ; Optionally, remove the supply from the location if you're tracking supplies individually
        )
    )

)

; problem
(define (problem default)
  (:domain default)
  (:objects l1_4 l2_2 l2_3 l2_4 l3_2 l3_3 l3_4 l4_2 l4_3 l4_4 - location agent_0 - agent obj_valve_0 obj_valve_1 - valve obj_bolt_0 obj_bolt_1 - bolt obj_tool_0 obj_tool_1 - tool box_0 box_1 - box workstation_0 - workstation warehouse_0 - warehouse ) 
  (:init  (adjacent l3_3 l3_4) (adjacent l2_4 l1_4) (adjacent l3_4 l3_3) (adjacent l3_4 l2_4) (adjacent l2_3 l2_2) 
  (adjacent l2_4 l2_3) (adjacent l2_4 l3_4) (adjacent l1_4 l2_4) (adjacent l2_3 l2_4) (adjacent l4_4 l3_4) 
  (adjacent l3_3 l4_3) (adjacent l4_2 l4_3) (adjacent l2_3 l3_3) (at agent_0 l4_3) (adjacent l2_2 l2_3) (adjacent l2_2 l3_2) 
  (adjacent l3_2 l4_2) (adjacent l4_3 l4_4) (adjacent l3_3 l3_2) (adjacent l4_3 l3_3) (adjacent l4_4 l4_3)
  (adjacent l3_3 l2_3) (adjacent l3_2 l2_2) (adjacent l3_2 l3_3) (adjacent l3_4 l4_4) (at obj_valve_0 l4_2)
  (adjacent l4_2 l3_2) (adjacent l4_3 l4_2) (free_from_agent l1_4) (free_from_agent l2_2)  (free_from_agent l2_3) (free_from_agent l2_4) (free_from_agent l3_2) (free_from_agent l3_3) (free_from_agent l3_4) (free_from_agent l4_2) (free_from_agent l4_4))
  (:goal (at agent_0 l1_4))
)

; plan
1. (move agent_0 l4_3 l4_4)
   deleted: (free_from_agent l4_4) (at agent_0 l4_3)
   added: (at agent_0 l4_4) (free_from_agent l4_3)
   goals met: 0 of 1
2. (move agent_0 l4_4 l3_4)
   deleted: (free_from_agent l3_4) (at agent_0 l4_4)
   added: (at agent_0 l3_4) (free_from_agent l4_4)
   goals met: 0 of 1
3. (move agent_0 l3_4 l2_4)
   deleted: (free_from_agent l2_4) (at agent_0 l3_4)
   added: (at agent_0 l2_4) (free_from_agent l3_4)
   goals met: 0 of 1
4. (move agent_0 l2_4 l1_4)
   deleted: (free_from_agent l1_4) (at agent_0 l2_4)
   added: (at agent_0 l1_4) (free_from_agent l2_4)
   goals met: 1 of 1
